#include <stdio.h>
#include <string.h>
#include <locale.h>
#include <head.h>

struct ZACH *write1(void)
{
	static struct ZACH Z1 =
	{
		"Чак",
		"Норрис",
		"Машинович",
		"1ТОП999",
		{
			{ 2017, //страница зачетки
			  1,//1й семестр
				{ //зачеты
					//{ "", "", "..", { notDiff, {.acc = 1} }  },
					{ "Введение в специальность", "Гончаров", "22.12.17", { notDiff, {.acc = 1} }  },
					{ "История России", "Гусев", "27.12.17", { notDiff, {.acc = 1} }  },
					{ "Русский язык и культура речи", "Терешкова", "09.01.18", { notDiff, {.acc = 1} }  },
					{ "Английский язык", "Толкачева", "10.01.18", { notDiff, {.acc = 1} }  },
					{ "Информатика", "Загвоздкина", "11.01.18", { notDiff, {.acc = 1} }  }
				},
				{ //экзамены
					//{ "", "", "..", { Diff, {.mark =  } }  },
					{ "Высшая математика", "Лакерник", "19.01.18", { Diff, {.mark = Good } }  },
					{ "Аналитическая геометрия и линейная алгебра", "Пискарев", "23.01.18", { Diff, {.mark = Excel} }  },
					{ "Философия", "Плужникова", "30.01.18", { Diff, {.mark = Excel} }  }
				}
			},
			{ 2018,
			  2,
				{
					{ "Эффективность Инвестиций и Инноваций", "Кузовков", "31.05.18", { notDiff, {.acc = 1} }  },
					{ "Физика", "Тренин", "01.06.18", { notDiff, {.acc = 1} }  },
					{ "Физическая Культура", "Симкачева", "08.06.18", { notDiff, {.acc = 1} }  },
					{ "Теоретические Основы Экономики", "Тришамова", "12.06.18", { notDiff, {.acc = 1} }  },
					{ "Компьютерная Графика", "Евстратов", "12.06.18", { notDiff, {.acc = 1} }  }
				},
				{
					{ "История", "Полянская", "18.06.18", { Diff, {.mark = Excel} }  },
					{ "Высшая Математика", "Лакерник", "21.06.18", { Diff, {.mark = Excel} }  },
					{ "Информатика", "Юскова", "25.06.18", { Diff, {.mark = Excel} }  },
					{ "Иностранный язык", "Кожевникова", "02.07.18", { Diff, {.mark = Good} }  }
				}
			},
			{ 2018,
			  3,
				{
					{ "ИРСиСРиР", "Коринский", "26.12.18", { notDiff, {.acc = 1} }  },
					{ "Вычислительные Математические Пакетные Пакеты Пакетов", "Юсков", "31.12.18", { notDiff, {.acc = 1} }  },
					{ "Теория Электрических Цепей Курсовая работа", "Григорьва", "09.01.19", { Diff,{.mark = Good} }  },
					{ "Теория Электрических Цепей", "Григорьва", "09.01.19", { notDiff, {.acc = 1} }  },
					{ "Теория Функций Комплексного Переменного", "Надежина", "08.01.19", { notDiff, {.acc = 1} }  },
					{ "Физические Основы Электроники", "Власов", "10.01.19", { notDiff, {.acc = 1} }  }
				},
				{
					{ "Дискретная Математика", "Лакерник", "15.01.19", { Diff, {.mark = Excel} }  },
					{ "Физика", "Тренин", "22.01.19", { Diff, {.mark = Excel} }  },
					{ "Вычислительные Модели", "Юсков", "31.12.18", { Diff, {.mark = Excel} }  },
					{ "Теория Вероятности и Математическая Статистика", "Смирнова", "66.66.66", { Diff, {.mark = Excel} }  }
				}
			},
			{ 2019,
			  4,
				{
					{ "Анализ Случайных процессов", "Flash", "$1.33.7$", { notDiff, {.acc = 1} }  },
					{ "Экология", "Эколог", "12.12.12", { notDiff, {.acc = 1} }  },
					{ "Вычислительные Модели Курсовая работа", "Загвоздкина", "12.03.19", { Diff, {.mark = Excel} }  },
					{ "Математическое Описание Теории Электромагнитных Полей", "Ястребцова", "12.04.19", { notDiff, {.acc = 1} }  },
					{ "Электромагнитные Поля и Волны", "Ястребцова", "12.04.19", { notDiff, {.acc = 1} }  },
					{ "Физическая Культура", "Несмертный", "00.07.19", { notDiff, {.acc = 1} }  },
					{ "Вычислительные Модели", "Загвоздкина", "12.03.19", { notDiff, {.acc = 1} }  },
					{ "Безопасные Практические Занятия", "Барков", "СЕЙЧАС", { notDiff, {.acc = 1} }  }//пожалуйста
				},
				{
					{ "Электроника", "Власов", "19.06.19", { Diff, {.mark = Excel} }  },
					{ "Теория Электрических Цепей", "Григорьева", "20.06.19", { Diff, {.mark = Excel} }  },
					{ "Общая Теория Связи", "Осипов", "21.06.19", { Diff, {.mark = Excel} }  },
					{ "Схемотехника Телекоммуникационных Устройств", "Долин", "вчера", { Diff, {.mark = Excel} }  }
				}
			},
		}
	 };
	return &Z1;
}

void strocher(struct ZACH *Z, int n)
{
	if (*Z->semI[n].prack[0].name)
	{
        printf("Результаты промежуточной аттестации (экзамены):\n\n%-65s %-10s %-10s %-60s\n\n","Наименование дисциплины","Оценка","Дата","Фамилия преподавателя");
	    for (int i = 0 ; *Z->semI[n].prack[i].name ; i++)
	    {
		    printf("%-65s %-10d %-10s %-60s\n", Z->semI[n].prack[i].name, Z->semI[n].prack[i].str.value.mark, Z->semI[n].prack[i].time, Z->semI[n].prack[i].teach);
	    }
	}
	else
	{
		printf("Данные об экзаменах отсутствуют\n");
	}
	printf("\n");
	if (*Z->semI[n].theor[0].name)
	{
		printf("Результаты промежуточной аттестации (зачеты):\n\n%-65s %-10s %-10s %-60s\n\n", "Наименование дисциплины", "Оценка", "Дата", "Фамилия преподавателя");
		for (int i = 0; *Z->semI[n].theor[i].name; i++)
		{
			if (Z->semI[n].theor[i].str.type == notDiff)
			{
				printf("%-65s %-10s %-10s %-60s\n", Z->semI[n].theor[i].name, Z->semI[n].theor[i].str.value.acc ? "Зачтено" : "Не зачтено", Z->semI[n].theor[i].time, Z->semI[n].theor[i].teach);
			}
			else
			{
				printf("%-65s %-10d %-10s %-60s\n", Z->semI[n].theor[i].name, Z->semI[n].theor[i].str.value.mark, Z->semI[n].theor[i].time, Z->semI[n].theor[i].teach);
			}
		}
	}
	else
	{
		printf("Данные о зачетах отсутствуют\n");
	}
}
void menu(struct ZACH *Z)
{
	do
	{
		printf("Номер зачетной книжки: %s\nФИО студента: %s %s %s\n", Z->number, Z->lastName, Z->firstName, Z->dadName);
		printf("2. Выберите вариант:\n1 - семестр №1\n2 - семестр №2\n3 - семестр №3\n4 - семестр №4\n5 - все семестры\n6 - в меню\n");
		switch (_getch())
		{
		case'1':
			system("cls");
			printf("Семестр 1:\n\n");
			strocher(Z, 0);
			break;
		case'2':
			system("cls");
			printf("Семестр 2:\n\n");
			strocher(Z, 1);
			break;
		case'3':
			system("cls");
			printf("Семестр 3:\n\n");
			strocher(Z, 2);
			break;
		case'4':
			system("cls");
			printf("Семестр 4:\n\n");
			strocher(Z, 3);
			break;
		case'5':
			system("cls");
			printf("Семестр 1:\n\n");
			strocher(Z, 0);
			printf("--------------------------------------------------------------------------------------------------------------------------------\n");
			printf("Семестр 2:\n\n");
			strocher(Z, 1);
			printf("--------------------------------------------------------------------------------------------------------------------------------\n");
			printf("Семестр 3:\n\n");
			strocher(Z, 2);
			printf("--------------------------------------------------------------------------------------------------------------------------------\n");
			printf("Семестр 4:\n\n");
			strocher(Z, 3);
			printf("--------------------------------------------------------------------------------------------------------------------------------\n");
			break;
		case'6':
			return;
		}
		system("pause");
		system("cls");
	} while (1);
}
void main(void)
{
	setlocale(LC_ALL, "Rus");
	struct ZACH *Z1 = write1();
	do
	{
		printf("1. Выберите вариант:\n1 - вариант 1\n2 - выход\n");
		switch (_getch())
		{
		case '1':
			system("cls");
			printf("Выбран первый вариант.\n");
			menu(Z1);
			break;
		case '2':
			exit(0);
		}
		system("pause");
		system("cls");
	} while (1);
}